app/views/users/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <% l = @posts.length; @posts.each_with_index {|post, i|
       submitter = User.find_by(id: post.submitter)