app/controllers/home_controller.rb

  def index
    @users = User.all
    @user = User.find(1)
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]